package  methods.other;
    /** Блок, показывающий все команды. */
public class Helper {
    public static void helper() {
        System.out.println(
                  " _______________________________________________________________" +
                "\n |- create course ----+- создать курс -------------------------|" +
                "\n |- create student ---+- создать cтудента ---------------------|" +
                "\n |- create trainer ---+- создать тренера ----------------------|" +
                "\n |- create task N ----+- создать вопрос в курсе N -------------|" +
                "\n |- show allstudents -+- показать всех студентов --------------|" +
                "\n |- show alltrainers -+- показать всех тренеров ---------------|" +
                "\n |- show course N ----+- показать курс с ID N -----------------|" +
                "\n |- show student N ---+- показать студента с ID N -------------|" +
                "\n |- show courses -----+- показать все курсы -------------------|" +
                "\n |- show students N --+- показать всех студентов курса с ID N -|" +
                "\n |- show trainer N ---+- показать тренера с ID N --------------|" +
                "\n |- show journal N ---+- показать успеваемость курса с ID N ---|" +
                "\n |- change student N -+- изменить параметры студента с ID N ---|" +
                "\n |- change course N --+- изменить параметры курса с ID N ------|" +
                "\n |- change trainer N -+- изменить параметры тренера с ID N ----|" +
                "\n |- save journal N ---+- сохранить успеваемость курса с ID N --|" +
                "\n |- exit -------------+- закрыть программу --------------------|" +
                "\n |- help -------------+- помощь(показать все команды) ---------|" +
                "\n ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯"
        );
    }
}
